# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'blendle/blendle'
tap 'homebrew/cask-fonts'

brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'autoconf'
brew 'awscli'
brew 'bat'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'docbook'
brew 'docbook-xsl'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fzf'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'gitleaks'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'go'
brew 'golangci-lint'
brew 'grep'
brew 'httpie'
brew 'icu4c'
brew 'imagemagick'
brew 'imath'
brew 'jbig2dec'
brew 'jpeg'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'lazydocker'
brew 'lazygit'
brew 'libde265'
brew 'libevent'
brew 'libffi'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'liblqr'
brew 'libmemcached'
brew 'libnghttp2'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'libsodium'
brew 'libssh2'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libzip'
brew 'little-cms2'
brew 'lsd'
brew 'luajit-openresty'
brew 'luv'
brew 'lz4'
brew 'm4'
brew 'memcached'
brew 'midnight-commander'
brew 'mpdecimal'
brew 'msgpack'
brew 'mysql'
brew 'ncurses'
brew 'neovim'
brew 'node'
brew 'oniguruma'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'pandoc'
brew 'pcre'
brew 'pcre2'
brew 'php'
brew 'php@7.4'
brew 'protobuf'
brew 'python@3.10'
brew 'python@3.9'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 's-lang'
brew 'shared-mime-info'
brew 'six'
brew 'sqlite'
brew 'starship'
brew 'stow'
brew 'terraform'
brew 'tidy-html5'
brew 'tmux'
brew 'trash'
brew 'tree'
# brew 'tree-sitter'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'webp'
brew 'wget'
brew 'wimlib'
brew 'x265'
brew 'xmlto'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zstd'


cask 'alacritty'
cask 'appcleaner'
cask 'caffeine'
cask 'clipy'
cask 'docker'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'github'
cask 'goland'
cask 'google-chrome'
cask 'kitty'
cask 'notion'
# cask 'openvpn-connect'
cask 'phpstorm'
cask 'postman'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'whatsapp'
